---
kind: method
id: M:Autodesk.Revit.UI.ExternalEvent.Dispose
source: html/d97056f5-5bdb-2ed1-3a76-1a2ce406d3b5.htm
---
# Autodesk.Revit.UI.ExternalEvent.Dispose Method

Releases all resources used by the ExternalEvent

## Syntax (C#)
```csharp
public void Dispose()
```